import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;

public class Instruction {


    public static void main(String[] args) throws IOException, InterruptedException {
        ZavdaniaInfo();
        Vuxid();
        Info();
    }

    private static void Vuxid() throws IOException, InterruptedException {
        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        System.out.println("Натисніть 1 повернутись в меню");
        int a = Integer.parseInt(reader.readLine());
        if (a == 1) {
            TestAcademy.Vxod();
        } else {
            System.out.println("Ви ввели не то значення"+" "+"Введіть ще раз");
            for(int i=0;i<20;i++){
                System.out.print("*"+" ");}
            System.out.println();
            InfoAcademy. Vuxid();}
    }//Повернення в меню


    static void ZavdaniaInfo() throws IOException, InterruptedException {
System.out.println("Про автора завдання:Випускник коледжу по спеціальності програміст,велике бажання вчити Java:\n"+
"Завдання видано для вступу на курси,воно не повністю відповідає заданим критеріям, його змінено\n"+
"Завдання полягало в створенні програми першокурсинків.На основы даного продукту взято реальну онлайн академію курсів програмування \n" +
"з випадковими іменами і даними.Завдання виконано але у форматі не простого університету а академії \"Mate Academy\"\n"+
"Таке завдання виконується 1 раз тому код не оптимізований і має більше 1000 строк\n" +
"Завдання мож удосконалити добавивши різні дії,більше виборів курсів,покращити дизайн,передбачити більше випадків коли \n" +
"користувач вводить не вірну інформаціюта оптимізацію коду.\n");
        Vuxid();
    }

    static void Info() throws IOException, InterruptedException {
System.out.println("Інструкція\n"+
"Перед вами головна сторінка і вибір з діями,якщо ви нажмете \"1\" ви побачите інформацію про академію та форму заявки на вступ\n" +
"Якщо ви не правильно введете число вам виб'є повідомлення про порушення і вибір подальших дій\n"+
"Натиснувши в меню \"2\"відкриється сторінка для студентів академії,треба вибрати курс на якому навчається студент,і тоді можна побачити\n"+
"список студентів які навчаються на тому курсі,їхній серній бал,номерацію в журналі,можна виконати вибір старости групи але при умові що він відмінник\n"+
"Натиснувши в меню число \"3\" ви можете побачити інформацію про студентів для цього потрібно вибрати курс студента і відкриється сторінка\n"+
"де буде список учнів курсу,їхній середній бал,порядковий номер в журналі,прізвище та ім'я професора\n"+
"Наступна сторінка для професорів.Вони можуть бачити списки студентів,робити перекличку з початку та з кінця журналу,і викликати студентів\n"+
"На \"5\" сторінці ви можете обрати курс за яким бажаєте вчитись та вислати заявку на вступ\n"+
"На \"6\" сторінці зображена інформація про завдання");
        Vuxid();
    }




    }

